

List sonan=[
  {

 "id": "1",
    "text": '''يقول الله تعالى في مُحكَم تنزيله: قُلْ أَطِيعُوا اللَّهَ وَأَطِيعُوا الرَّسُولَ فَإِنْ تَوَلَّوْا فَإِنَّمَا عَلَيْهِ مَا حُمِّلَ وَعَلَيْكُمْ مَا حُمِّلْتُمْ وَإِنْ تُطِيعُوهُ تَهْتَدُوا وَمَا عَلَى الرَّسُولِ إِلَّا الْبَلَاغُ الْمُبِينُ  [النور: 54]، فطاعة النبي تشمل إحياء سنَّته وهو سبَبُ الهدايةِ كما أشارت الآية الكريمة.

- مما يزيد الإيمان هو فعل الأعمال الصالحة فالإيمان يزيد وينقص والأعمال الصالحة تشمل إحياء السنة فبفعلها وتعليمها ونشرها يزيد الإيمان

- استمرار أجر القائم بها أو المعلم لها بعد مماته وفي الحديث قوله ﷺ:
«ينقطِعُ عمل المرءِ بعده إلَّا مِن ثلاثٍ: علمٍ علَّمه فعُمِل به بعده، وصدقةٍ مَوقوفة يَجري عليه أجرُها، وولدٍ صالح يَدعو له»

- الوصول إلى درجة محبَّة الله تعالى لنا.

قال الله تعالي: ﴿قُلْ إِنْ كُنْتُمْ تُحِبُّونَ اللَّهَ فَاتَّبِعُونِي يُحْبِبْكُمُ اللَّهُ وَيَغْفِرْ لَكُمْ ذُنُوبَكُمْ وَاللَّهُ غَفُورٌ رَحِيمٌ﴾
'''
},
  {
 "id": "2",
    "text": '''عن أنس رضي الله عنه قال: كان رسول الله صلَّى الله عليه وسلَّم إذا صافح رجلاً لم يترك يده؛ حتَّى يكون المصافح هو التَّارك ليد رسول الله صلَّى الله عليه وسلَّم.
'''
},
  {
 "id": "3",
    "text": '''سجود الشُّكر سنَّة عند حدوث نعمة طالما كان ينتظرها، أو اندفاع بليَّة ينتظر انكشافها). وقال ابن القيم في زاد المعاد:(وكان من هديه صلَّى الله عليه وسلَّم وهدي أصحابه، سجود الشُّكر عند تجدُّد نعمة تسر، أو اندفاع نقمة
'''
},
  {
 "id": "4",
    "text": '''عن أبي هريرة رضي الله عنه، عن النَّبيِّ صلَّى الله عليه وسلَّم قال:(نعم سحور المؤمن التَّمر)رواه أبو داود، وصحَّحه الألباني. قال ابن القيم في زاد المعاد عن التَّمر:(وهو فاكهة، وغذاء، ودواء، وشراب، وحلوى).
'''
},
  {
 "id": "5",
    "text": '''عن أنسٍ رضي الله عنه قال: كان رسول الله صلَّى الله عليه وسلَّم يتنفَّس في الشَّراب ثلاثاً ويقول:(إنَّه أروى، وأبرأ، وأمْرأ)متفق عليه.
'''
},
  {
 "id": "6",
    "text": '''عن أبي بكر الصِّديق رضي الله عنه أنَّ النَّبيَّ صلَّى الله عليه وسلَّم قال:(ما من رجلٍ يذنب ذنباً، ثمَّ يقوم فيتطهر، ثمَّ يصلِّي - وفي رواية: ركعتين - ثمَّ يستغفر الله؛ إلا غفر الله له)
'''
},
  {
 "id": "7",
    "text": '''
أخرج البخاري ومسلم، في قصَّة كعب رضي الله عنه قوله:(قلت: يا رسول الله!! إنَّ من توبتي أن أنخلع من مالي صدقة إلى الله وإلى رسوله، قال رسول الله: أمسك عليك بعض مالك، فهو خيرٌ لك). قال ابن القيم في الزَّاد:(وقول كعب يا رسول الله!! إنَّ من توبتي أن أنخلع من مالي، دليلٌ على استحباب الصَّدقة عند التَّوبة بما قدر عليه من المال).
'''
},
  {
 "id": "8",
    "text": '''قول النبي ﷺ: إذا دخل أحد المسجد فلا يجلس حتى يصلي ركعتين وفي اللفظ الآخر: فليركع ركعتين قبل أن يجلس
'''
},
  {
 "id": "9",
    "text": '''قال تعالى : يَخْرُجُ مِن بُطُونِهَا شَرَابٌ مُّخْتَلِفٌ أَلْوَانُهُ فِيهِ شِفَاءٌ لِّلنَّاسِ

عن أبي سعيد -رضي الله عنه-: أن رجلا أتى النبي -صلى الله عليه وسلم- فقال: «أخي يشتكي بطنه ؟ فقال: اسقه عسلا،فسقاه ثم أتاه للمرة الثانية فقال: اسقه عسلا. ثم أتاه الثالثة،فقال: اسقه عسلا. ثم أتاه مجددا فقال: قد فعلت. فقال: صدق الله وكذب بطن أخيك، اسقه عسلا، فسقاه فبرأ»(3).
'''
},
  {
 "id": "10",
    "text": '''عن عائشة رضي الله عنها قالت: كان رسول الله إذا دخل منزله بدأ بالسواك. وثبت علميا أن السواك مطهرة للفم لمدة 6 ساعات بينما معجون الأسنان لا يتجاوز الساعة.
'''
},
  {
 "id": "11",
    "text": '''عن أبي هريرة قال: قال عليه السلام: "إذا انتعل أحدكم فليبدأ باليمين وإذا خلع فليبدأ بالشمال"
'''
},
  {
 "id": "12",
    "text": '''عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ رضي الله عنه قال :

( كَانَ رَسُولُ اللَّهِ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ إِذَا اسْتَجَدَّ ثَوْبًا سَمَّاهُ بِاسْمِهِ ، إِمَّا قَمِيصًا أَوْ عِمَامَةً ، ثُمَّ يَقُولُ :

اللَّهُمَّ لَكَ الْحَمْدُ ، أَنْتَ كَسَوْتَنِيهِ ، أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا صُنِعَ لَهُ ، وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ )
'''
},
  {
 "id": "13",
    "text": '''ولعل البعض يستغرب من هذه السنة ولكن الرسول عليه السلام كان يصلي في نعليه عند الضرورة وقد قال عليه السلام: خالفوا اليهود فإنهم لا يصلون في خفافهم ولا نعالهم".
'''
},
  {
 "id": "14",
    "text": '''للبراء بن عازب رضي الله عنه قال النبي صلى الله عليه وسلم: (( إذا أتيت مضجعك، فتوضأ وضوءك للصلاة، ثم اضطجع على شقك الأيمن ))
'''
},
  {
 "id": "15",
    "text": '''عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال: (( إذا عطس أحدكم فليقل: الحمدلله، وليقل له أخوه أو صاحبه: يرحمك الله. فإذا قال له يرحمك الله، فليقل : يهديكم الله ويصلح بالكم ))
'''
},
  {
 "id": "16",
    "text": '''عن عائشة رضي الله عنها، أن رسول الله صلى الله عليه وسلم كان إذا رأى المطر قال: (( اللهم صيبّا نافعا ))
'''
},
  {
 "id": "17",
    "text": '''عن أبي موسى الأشعري رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال: (( الإستئذان ثلاث، فإن أذن لك، وإلا فارجع ))
'''
},
  {
 "id": "18",
    "text": '''عن المقدام بن معدي كرب رضي الله عنه، أن النبي صلى الله عليه وسلم قال: (( إذا أحب أحدكم أخاه، فليعلمه أنه يحبه ))
'''
},
  {
 "id": "19",
    "text": '''عن أبي هريرة رضي الله عنه، قال رسول الله صلى الله عليه وسلم : (( إياكم والظن، فإن الظن أكذب الحديث ))
'''
},
  {
 "id": "20",
    "text": '''عن سهل بن سعد رضي الله عنه، عن النبي صلى الله عليه وسلم قال: (( أنا وكافل اليتيم في الجنة هكذا )) وقال ( أشار ) بإصبعيه السبابة والوسطى.
'''
},
  {
 "id": "21",
    "text": '''عن أبي هريرة رضي الله عنه ، أن رجلاً قال للنبي صلى الله عليه وسلم : أوصني ، قال: (( لا تغضب )) . فردد مرارًا ، قال: (( لا تغضب ))
'''
},
  {
 "id": "22",
    "text": '''عن أبي هريرة رضي الله عنه، عن النبي صلى الله عليه وسلم قال: (( سبعة يظلهم الله في ظله، يوم لا ظل إلا ظله وذكر منهم : ورجل ذكر الله خاليا ففاضت عيناه ))
'''
},
  {
 "id": "23",
    "text": '''عن جابر بن عبد الله رضي الله عنهما، أن رسول الله صلى الله عليه وسلم قال: (( رحم الله رجلا سمحا إذا باع، وإذا اشترى، وإذا اقتضى ))
'''
},
  {
 "id": "24",
    "text": '''عن أبي هريرة رضي الله عنه، أن رسول الله صلى الله عليه وسلم قال : (( بينما رجل يمشي بطريق، وجد غصن شوك على الطريق، فأخره، فشكر الله له، فغفر له ))
'''
},
  {
 "id": "25",
    "text": '''عن أبي هريرة رضي الله عنه قال، قال رسول الله صلى الله عليه وسلم : (( من تصدق بعدل تمرة من كسب طيب، ولا يقبل الله إلا الطيب، فإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوة حتى تكون مثل الجمل ))
'''
},
  {
 "id": "26",
    "text": '''عن عائشة رضي الله عنها، سئل رسول الله صلى الله عليه وسلم : أي الأعمال أحب إلى الله ؟ قال: (( أدومها وإن قل ))
'''
},
  {
 "id": "27",
    "text": '''عن جابر رضي الله عنه: أَنَّ النَّبِيَّ صلَّى الله عليه وسلَّم أَمَرَ بِلَعْقِ الأَصَابِعِ وَالصَّحْفَةِ، وَقَالَ: (إِنَّكُمْ لاَ تَدْرُونَ فِي أَيِّهِ الْبَرَكَةُ)رواه مسلم. وفي لفظ:(إذا وقعت لقمة أحدكم فليأخذها، فليمط ما كان بها من الأذى، وليأكلها، ولا يدعها للشَّيطان، ولا يمسح يده بالمنديل حتَّى يلعق أصابعه، فإنَّه لا يدري في أيِّ طعامه البركة)رواه مسلم.
'''
},
  {
 "id": "28",
    "text": '''عن الأسود قال: سَألتُ عائشة ـ رضي الله عنها ـ ما كان النبي ـ صلى الله عليه وسلم ـ يصنع في بيته؟ قالت: (( كان يكون في مهنة أهله (أي: خدمتهم) ، فإذا حضرت الصلاة خرج إلى الصلاة )) [ رواه البخاري ] .
'''
},
  {
 "id": "29",
    "text": '''عن أبي ذر ـ رضي الله عنه ـ قال: قال لي النبي صلى الله عليه وسلم : (( لا تحقرن من المعروف شيئا ، ولو أن تلقى أخاك بوجه طلق ))
'''
},
  {
 "id": "30",
    "text": '''قول رسول الله صلي الله عليه وسلم: من قام بعشر آيات لم يكتب من الغافلين، ومن قام بمائة آية كتب من القانتين، ومن قام بألف آية كتب من المقنطرين.
'''
},
  {
 "id": "31",
    "text": '''
عن أبي هريرة رضي الله عنه قال، قال رسول الله: "لا يشربن أحد منكم قائمًا، فمن نسي فليستقيئ"، وهو توجيه إلى طريقة شرب الماء إذ تكون بالجلوس لا بالوقوف والقيام. عن أبي سعيد الخدري رضي الله عنه: "أن النبي صلى الله عليه وسلم زجر عن الشرب قائمًا". عن أبي هريرة رضي الله عنه قال: "أن رسول الله كان يشرب في ثلاثة أنفاس، إذا أدنى الإناء إلى فيه (فمه) يسمي الله، فإذا أخره حمد الله، يفعل به ثلاث مرات"، فلا يجب شرب الماء دفعة واحدة وإنما بـ 3 دفعات اقتداءً بالنبي الكريم. عن المقداد بن المعدي بن كعب قال النبي صلى الله عليه وسلم: "ما ملأ آدمي وعاء شرًا من بطنه، بحسب ابن آدم أكلات يقمن صلبه فإن كان لا محالة فثلث لطعامه، وثلث لشرابه، وثلث لنفسه" وفي هذا الحديث يوجه الرسول المسلمين إلى الاقتصاد في المشرب والمأكل دون مبالغة. جاء في النسائي وتصحيح ابن حبان أن الرسول صلى الله عليه وسلم "كان إذا أكل أو شرب قال: الحمد لله الذي أطعم وسقى وسوغه وجعل له مخرجًا"، فمن واجب المسلم أن يحمد الله على نعمة الماء بعد أن يفرغ منه.
'''
},
  {
 "id": "32",
    "text": '''
هذه السنة كذلك من السنن المهجورة التي غفل الناس عن أجرها، وفوتوا إدراك فضلها بالانشغال بالأعمال والتجارات، وقد سمّاها النبي الكريم في الحديث صلاة الأوابين، قال عليه الصلاة والسلام: (صلاة الأوابين حين ترمض الفصال من الضحى).[٣]كما أقسم الله عزّ وجل في كتابه العزيز بوقت هذه الصلاة في سورة الضحى.
'''
},
  {
 "id": "33",
    "text": '''
فالسلام من شعائر الإسلام، وتحية المسلمين فيما بينهم، وهي من حق المسلم على أخيه المسلم، فينبغي أن تشيع سنة السلام بين المسلمين مع من يعرفهم المسلم أو لا يعرفهم من الناس لما في السلام من إشاعة للمحبة بين الناس.
'''
},
  {
 "id": "34",
    "text": '''عن عبدالله بن زيد رضي الله عنه ، أنَّ رسول الله صلى الله عليه وسلم : (( تمضمض ، واستنشق من كف واحدة ))
'''
},
  {
 "id": "35",
    "text": '''
عن عائشة رضي الله عنها أن النبي صلى الله عليه وسلم كان إذا أوى إلى فراشه كل ليلة جمع كفيه ثم نفث فيهما ، فقرأ فيهما: (( قل هو الله أحد )) و (( قل أعوذ برب الفلق )) و (( قل أعوذ برب الناس )) ، ثم يمسح بهما ما استطاع من جسده ، يبدأ بهما على رأسه ووجهه ، وما أقبل من جسده ، يفعل ذلك ثلاث مرات.
'''
},
  {
 "id": "36",
    "text": '''عن جابر رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم : (( إذا قضى أحدكم الصلاة في مسجده فليجعل لبيته نصيبًا من صلاته ، فإن الله جاعل في بيته من صلاته خيرا ))
'''
},
  {
 "id": "37",
    "text": '''عن أبي هريرة رضي الله عنه قال: (( أوصاني خليلي بثلاث ، لا أدعهن حتى أموت: صوم ثلاثة أيام من كل شهر ، وصلاة الضحى ، ونوم على وتر ))
'''
},
  {
 "id": "38",
    "text": '''
عن جابر رضي الله عنه قال: (( كنا إذا صعدنا كبرنا ، وإذا نزلنا سبحنا ))
* يكون التكبير عند صعود المرتفعات ، والتسبيح عند النزول وانحدار الطريق.
'''
},
  {
 "id": "39",
    "text": '''عن كعب بن مالك رضي الله عنه قال: (( كان النبي صلى الله عليه وسلم إذا قدم من سفر بدأ بالمسجد فصلى فيه ))
'''
},
  {
 "id": "40",
    "text": '''عن عمر بن أبي سلمة رضي الله عنه قال: كنت في حجر رسول الله صلى الله عليه وسلم وكانت يدي تطيش في الصحفة ، فقال لي: (( يا غلام سم الله ، وكل بيمينك، وكل مما يليك ))
'''
},
  {
 "id": "41",
    "text": '''عن أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم : (( إن الله ليرضى عن العبد أن يأكل الأكلة فيحمده عليها ، أو يشرب الشربة فيحمده عليها ))
'''
},
  {
 "id": "42",
    "text": '''عن أبي هريرة رضي الله عنه قال: (( ما عاب رسول الله صلى الله عليه وسلم طعامًا قط ، كان إذا اشتهاه أكله ، وإن كرهه تركه ))
'''
},
  {
 "id": "43",
    "text": '''عن أبي أمامة الباهلي رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (( اقرؤوا القرآن ، فإنه يأتي يوم القيامة شفيعًا لأصحابه ))
'''
},
  {
 "id": "44",
    "text": '''عن عائشة رضي الله عنها قالت: (( كان رسول الله صلى الله عليه وسلم يذكر الله على كل أحيانه ))
'''
},
  {
 "id": "45",
    "text": '''
عن عثمان بن أبي العاص رضي الله عنه ، أنه شكا إلى رسول الله ـصلى الله عليه وسلم وجعًا، يجده في جسده مُنذ أسلم ، فقال له رسول الله صلى الله عليه وسلم : (( ضع يدك على الذي يألم من جسدك، وقل: باسم الله ، ثلاثًا ، وقل سبع مرات: أعوذُ بالله وقدرتهِ من شَر ما أجد وأُحَاذر ))
'''
},
  {
 "id": "46",
    "text": '''عن أبي هريرة رضي الله عنه ، أن النبي صلى الله عليه وسلم قال: (( إذا سمعتم صياح الديكة فاسألوا الله من فضله، فإنها رأت مَلَكًا ، وإذا سمعتم نهيق الحمار فتعوذوا بالله من الشيطان ، فإنها رأت شيطانًا ))
'''
},
  {
 "id": "47",
    "text": '''عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (( ما جلس قوم مجلسًا لم يذكروا الله فيه ، ولم يُصَلوا على نبيهم،إلا كان عليهم تِرَة (أي: حسرة) فإن شاء عذبهم، وإن شاء غفر لهم ))
'''
},
  {
 "id": "48",
    "text": '''عن أنس بن مالك رضي الله عنه قال: كان النبي صلى الله عليه وسلم إذا دخل (أي: أراد دخول) الخلاء قال: (( اللهم إني أعوذ بك من الخبث والخبائث ))
'''
},
  {
 "id": "49",
    "text": '''
عن أبي موسى الأشعري رضي الله عنه قال: (( وُلد لي غلام ، فأتيت به النبي صلى الله عليه وسلم فسماه إبراهيم ، فحنكه بتمرة ودعا له بالبركة ))
* التحنيك: هو مضغ طعام حلو ، وتحريكه في فم المولود ، والسنة أن يكون التحنيك بالتمر.
'''
},
  {
 "id": "50",
    "text": '''عن ثوبان ، مولى رسول الله صلى الله عليه وسلم ، عن رسول الله صلى الله عليه وسلم قال: (( من عاد مريضا ، لم يزل في خُرفَة الجنة )) قيل : يا رسول الله! وما خُرفة الجنة؟ قال: (( جناها ))
'''
},
  {
 "id": "51",
    "text": '''عن سهل بن سعد رضي الله عنه ، عن النبي صلى الله عليه وسلم قال: (( أنا وكافل اليتيم في الجنة هكذا )) . و قال بإصبعيه السبابة والوسطى.
'''
},
  {
 "id": "52",
    "text": '''عن أبي هريرة رضي الله عنه ، أن رجلاً قال للنبي صلى الله عليه وسلم : أوصني ، قال: (( لا تغضب )) . فردد مرارًا ، قال: (( لا تغضب ))
'''
},
  {
 "id": "53",
    "text": '''عن أبي هريرة رضي الله عنه ، عن النبي ـ صلى الله عليه وسلم ـ قال: (( سبعة يظلهم الله في ظله ، يوم لا ظل إلا ظله ... وذكر منهم : ورجل ذكر الله خاليًا ففاضت عيناه ))
'''
},
  {
 "id": "54",
    "text": '''عن جابر بن عبدالله رضي الله عنهما ، أن رسول الله صلى الله عليه وسلم ـ قال: (( رحم الله رجلاً سمحًا إذا باع ، و إذا اشترى ، وإذا اقتضى ))
'''
},
  {
 "id": "55",
    "text": '''
عن أبي هريرة رضي الله عنه قال ، قال رسول الله صلى الله عليه وسلم : (( من تصدق بعدل تمرة من كسب طيب ، ولا يقبل الله إلا الطيب ، فإن الله يتقبلها بيمينه ، ثم يربيها لصاحبه كما يربي أحدكم فَلُوة حتى تكون مثل الجبل ))
'''
},
  {
 "id": "56",
    "text": '''عن أبي مسعود البدري رضي الله عنه ، عن النبي صلى الله عليه وسلم قال: (( إن المسلم إذا أنفق على أهله نفقة ، وهو يحتسبُها، كانت له صدقة ))
'''
},
  {
 "id": "57",
    "text": '''عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: (الإيمان بضع وستون شعبة، والحياء شعبة من الإيمان)
'''
},
  {
 "id": "58",
    "text": '''رُوي عن عائشة أم المؤمنين رضي الله عنها أنها قالت: (أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ كانَ لا يَدَعُ أرْبَعًا قَبْلَ الظُّهْرِ، ورَكْعَتَيْنِ قَبْلَ الغَدَاةِ)
'''
},
  {
 "id": "59",
    "text": '''عن أبي هريرة رضي الله عنه، قَالَ: قَالَ رَسُول الله صلى الله عليه وسلم (( مِنْ حُسْنِ إسْلامِ المَرْءِ تَرْكُهُ مَا لا يَعْنِيهِ ))
'''
},


];

List alhadith = [
  {
    "id": "1",
    "text": ''' 
عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (كلمتان خفيفتان على اللسان، ثقيلتان في الميزان، حبيبتان إلى الرحمن، سبحان الله وبحمده، سبحان الله العظيم) رواه البخاري ومسلم

المصدر: تطبيق الطريق الى الجنة'''
  },
  {
    'id': '2',
    'text': '''
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (لا تجعلوا بيوتكم مقابر، إن الشيطان ينفر من البيت الذي تقرأ فيه سورة البقرة) رواه مسلم''',
  },
  {
    'id': '3',
    'text': '''
عن ابن مسعود رضي الله عنه قال: قال النبي صلى الله عليه وسلم: (من قرأ بالآيتين من آخر سور البقرة في ليلة كفتاه) رواه البخاري ومسلم''',
  },
  {
    'id': '4',
    'text': '''
عن أبي الدرداء رضي الله عنه أن النبي صلى الله عليه وسلم قال: (من حفظ عشر آيات من أول سورة الكهف عُصم من الدجال) رواه مسلم''',
  },
  {
    'id': '5',
    'text': '''
عن عائشة رضي الله عنها عن النبي صلى الله عليه وسلم قال: (ركعتا الفجر خير من الدنيا وما فيها) رواه مسلم''',
  },
  {
    'id': '6',
    'text': '''

عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه) رواه البخاري ومسلم''',
  },
  {
    'id': '7',
    'text': '''
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من صلى علي صلاة واحدة صلى الله عليه عشراً) رواه مسلم''',
  },
  {
    'id': '8',
    'text': '''
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إذا قلت لصاحبك: أنصت، يوم الجمعة والإمام يخطب، فقد لغوت) رواه ا''',
  },
  {
    'id': '9',
    'text': '''
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (من كذب علي متعمداً فليتبوأ مقعده من النار) رواه البخاري ومسلم''',
  },
  {
    'id': '10',
    'text': '''
عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (كل أمتي يدخلون الجنة إلا من أبى) قالوا: يا رسول الله: ومن يأبى؟ قال: (من أطاعني دخل الجنة، ومن عصاني فقد أبى) رواه البخاري''',
  },
  {
    'id': '11',
    'text': '''
عن أبي هريرة رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (المؤمن القوي خير وأحب إلى الله من المؤمن الضعيف، وفي كل خير، احرص على ما ينفعك، واستعن بالله ولا تعجز، وإن أصابك شيء فلا تقل: لو أني فعلت كان كذا وكذا، ولكن قل: قدَر الله وما شاء فعل، فإن لو تفتح عمل الشيطان) رواه مسلم''',
  },
  {
    'id': '12',
    'text': '''

عن أبي هريرة رضي الله عنه أن رسول الله صلى الله عليه وسلم قال: (إن لله تسعة وتسعين اسما مائة إلا واحدا، من أحصاها دخل الجنة) رواه البخاري ومسلم
المصدر: تطبيق الطريق الى الجنة''',
  },
  {
    'id': '13',
    'text': ''' 
عن أبي هريرة رضي الله عنه عن النبي صلى الله عليه وسلم قال: قال الله عز وجل: (سبقت رحمتي غضبي) رواه البخاري ومسلم''',
  },
  {
    'id': '14',
    'text': ''' 
عن أنس رضي الله عنه عن النبي صلى الله عليه وسلم أنه قال: (لا يؤمن أحدكم حتى أكون أحب إليه من والده وولده والناس أجمعين) رواه البخاري ومسلم''',
  },
  {
    'id': '15',
    'text': ''' 
عن أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وسلم قال: (لا يؤمن أحدكم حتى يحب لأخيه ما يحب لنفسه) رواه البخاري ومسلم''',
  },
  {
    'id': '16',
    'text': ''' 
عن عثمان بن عفان رضي الله عنه قال: قال رسول الله صلى الله عليه وسلم: (خيركم من تعلم القرآن وعلمه) رواه البخاري''',
  },
];










List athkaralnom = [
  {
    "id": "1",
    "details":"",
    "text": ''' 
((يَجْمَعُ كَفَّيْهِ ثُمَّ يَنْفُثُ فِيهِمَا فَيَقْرَأُ فِيهِمَا:
بسم الله الرحمن الرحيم
﴿قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَدُ ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.
بسم الله الرحمن الرحيم
﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَق ۝ مِن شَرِّ مَا خَلَق ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.
بسم الله الرحمن الرحيم
﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاس ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ  مِنَ الْجِنَّةِ وَ النَّاسِ﴾
ثُمَّ يَمْسَحُ بِهِمَا مَا اسْتَطَاعَ مِنْ جَسَدِهِ يَبْدَأُ بِهِمَا عَلَى رَأْسِهِ وَوَجْهِهِ وَمَا أَقبَلَ مِنْ جَسَدِهِ)) (يفعلُ ذلك ثلاثَ مرَّاتٍ)
'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''أذكار النوم
أعوذ بالله من الشيطن الرجيم
﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْـــــــــــدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾
'''
  },
  {
    'id': '3',
    "details":"",
    'text': '''أذكار النوم
أعوذ بالله من الشيطن الرجيم
﴿آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلآئِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ* لاَ يُكَلِّفُ اللَّهُ نَفْساً إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْراً كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَآ أَنتَ مَوْلاَنَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ﴾.

''',
  },
  {
    'id': '4',
    "details":"",
    'text': '''
أذكار النوم
((بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي، وَبِكَ أَرْفَعُهُ، فَإِن أَمْسَكْتَ نَفْسِي فارْحَمْهَا، وَإِنْ أَرْسَلْتَهَا فَاحْفَظْهَا، بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ)).''',
  },
  {
    'id': '5',
    "details":"",
    'text': '''أذكار النوم
((اللَّهُمَّ إِنَّكَ خَلَقْتَ نَفْسِي وَأَنْتَ تَوَفَّاهَا، لَكَ مَمَاتُهَا وَمَحْياهَا، إِنْ أَحْيَيْتَهَا فَاحْفَظْهَا، وَإِنْ أَمَتَّهَا فَاغْفِرْ لَهَا. اللَّهُمَّ إِنِّي أَسْأَلُكَ العَافِيَةَ)).
'''
  },
  {
    'id': '6',
    "details":"",
    'text': ''' 

عن عمر بن الخطاب رضي الله عنه قال: سمعت رسول الله صلى الله عليه وسلم يقول: (إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله، فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة يتزوجها، فهجرته إلى ما هاجر إليه) رواه البخاري ومسلم''',
  },
  {
    'id': '7',
    "details":"",
    'text': '''
أذكار النوم
((اللَّهُمَّ قِنِي عَذَابَكَ يَوْمَ تَبْعَثُ عِبَادَكَ)).
'''
  },
  {
    'id': '8',
    "details":"",
    'text': '''
أذكار النوم
((بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا)).
'''
  },
  {
    'id': '9',
    "details":"",
    'text': '''أذكار النوم
((اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَرَبَّ الأَرْضِ، وَرَبَّ الْعَرْشِ الْعَظِيمِ، رَبَّنَا وَرَبَّ كُلِّ شَيْءٍ، فَالِقَ الْحَبِّ وَالنَّوَى، وَمُنْزِلَ التَّوْرَاةِ وَالْإِنْجِيلِ، وَالْفُرْقَانِ، أَعُوذُ بِكَ مِنْ شَرِّ كُلِّ شَيْءٍ أَنْتَ آخِذٌ بِنَاصِيَتِهِ. اللَّهُمَّ أَنْتَ الأَوَّلُ فَلَيْسَ قَبْلَكَ شَيْءٌ، وَأَنْتَ الآخِرُ فَلَيسَ بَعْدَكَ شَيْءٌ، وَأَنْتَ الظَّاهِرُ فَلَيْسَ فَوْقَكَ شَيْءٌ، وَأَنْتَ الْبَاطِنُ فَلَيْسَ دُونَكَ شَيْءٌ، اقْضِ عَنَّا الدَّيْنَ وَأَغْنِنَا مِنَ الْفَقْرِ)).'''
  },
  {
    'id': '10',
    "details":"",
    'text': '''أذكار النوم
((اللَّهُمَّ عَالِمَ الغَيْبِ وَالشَّهَادَةِ فَاطِرَ السَّمَوَاتِ وَالْأَرْضِ، رَبَّ كُلِّ شَيْءٍ وَمَلِيكَهُ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ، أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي، وَمِنْ شَرِّ الشَّيْطانِ وَشِرْكِهِ، وَأَنْ أَقْتَرِفَ عَلَى نَفْسِي سُوءاً، أَوْ أَجُرَّهُ إِلَى مُسْلِمٍ)).'''
  },
];
  






    



    
// ثلاثه مفاتيح

List athkaralmsaa = [
  {
    "id": "1",
    "text": ''' 

أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾
''',
    'details': '''فضلها 👉⁉️
من قالها حين يصبح أُجير من الجن حتى يمسي، ومن قالها حين يمسي أُجير منهم حتى يصبح'''
  },
  {
    'id': '2',
    'text': '''أذكار المساء
أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ

آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]. 
''',
    'details': '''
  فضلها 👉⁉️
عن أَبي مسعودٍ البدْرِيِّ رضي الله عنه عن النبيِّ ﷺ قَالَ: منْ قَرَأَ بالآيتَيْنِ مِنْ آخِرِ سُورةِ البقَرةِ فِي لَيْلَةٍ كَفَتَاهُ
  '''
  },
  {
    'id': '3',
    'text': '''
المعوذات 

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَد ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاس ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَ النَّاسِ﴾
''',
    'details': '''فضلها👉⁉️
من قرأ ( قل هو الله أحد ) و ( المعوذتين ) حين يصبح وحين يمسى ثلاث مرات كفته من كل شىء – رواه ابو داوود والترمذي  ''',
  },
  {
    'id': '4',
    'text': '''
أذكار المساء
 اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ، خَلَقْتَنـي وَأَنا عَبْـدُك، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت، أَعـوذُ بِكَ مِنْ شَـرِّ ما صَنَـعْت، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ. 
 ''',
    'details': ''' فضلها👉⁉️
من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.
المصدر: تطبيق الطريق الى الجنة ''',
  },
  {
    'id': '5',
    'text': '''أذكار المساء
 رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. ''',
    'details': ''' فضلها👉⁉️
من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة. ''',
  },
];










List athkaralsbaah = [
  {
    "id": "1",
    
    "text": ''' 

أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيم أذكار الصباح
﴿اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَوَاتِ وَالْأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ﴾''',
    'details': '''فضلها 👉⁉️
من قالها حين يصبح أُجير من الجن حتى يمسي، ومن قالها حين يمسي أُجير منهم حتى يصبح'''
  },
  {
    'id': '2',
    'text': '''أذكار الصباح
 اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك ، وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ، أَعـوذُ بِكَ مِنْ شَـرِ ما صَنَـعْت ، أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ. ''',
    'details': '''
  فضلها 👉⁉️
من قالها موقناً بها حين يصبح فمات من يومه دخل الجنة ومن قالها موقناً بها حين يمسي فمات من ليلته دخل الجنة – رواه البخاري '''
  },
  {
    'id': '3',
    'text': '''
المعوذات 

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ هُوَ اللَّهُ أَحَدٌ ۝ اللَّهُ الصَّمَد ۝ لَمْ يَلِدْ وَلَمْ يُولَدْ ۝ وَلَمْ يَكُن لَّهُ كُفُواً أَحَدٌ﴾.

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ ۝ مِن شَرِّ مَا خَلَقَ ۝ وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ ۝ وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ ۝ وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ﴾.

بسم الله الرَّحْمَنِ الرَّحِيمِ 
﴿قُلْ أَعُوذُ بِرَبِّ النَّاسِ ۝ مَلِكِ النَّاسِ ۝ إِلَهِ النَّاسِ ۝ مِن شَرِّ الْوَسْوَاسِ الْخَنَّاس ۝ الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ ۝ مِنَ الْجِنَّةِ وَ النَّاسِ﴾
''',
    'details': '''فضلها👉⁉️
من قرأ ( قل هو الله أحد ) و ( المعوذتين ) حين يصبح وحين يمسى ثلاث مرات كفته من كل شىء – رواه ابو داوود والترمذي  ''',
  },
  {
    'id': '4',
    'text': '''

أذكار الصباح
اللهـمَّ إِنِّـي أَصْبَـحْتُ أَشْـهِدُك وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلائِكَتَكَ وَجَمـيعَ خَلْـقِك ، أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ , وَحْـدَكَ لا شَريكَ لَـك ، وَأَنَّ ُمُحَمّـداً عَبْـدُكَ وَرَسـولُـك''',
    'details': ''' فضلها 👉⁉️
من قالها حين يصبح أو حين يمسي أربع مرات اعتقه الله من النار- رواه ابو داوود''',
  },
  {
    'id': '5',
    'text': '''أذكار الصباح
 اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ، فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. 
 ''',
    'details': ''' فضلها 👉⁉️
من قرأها حين يصبح فقد أدى شكر يومه ومن قرأها حين يمسي فقد ادى شكر ليلته – رواه ابو داوود ''',
  },
];







//الصلاه على النبي
List alnaby = [
  {
    "id": "1",
    "details":"",
    "text": ''' الصلاة على النبي
قَالَ النَّبِيُّ صلى الله عليه وسلم: ((مَنْ صَلَّى عَلَيَّ صَلاَةً صَلَّى اللَّهُ عَلَيْهِ بِهَا عَشْراً)).
'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''الصلاة على النبي
وَقَالَ صلى الله عليه وسلم: ((لاَ تَجْعَلُوا قَبْرِي عِيداً وَصَلُّوا عَلَيَّ؛ فَإِنَّ صَلاَتَكُم تَبْلُغُنِي حَيْثُ كُنْتُمْ)).'''
  },
  {
    'id': '3',
    "details":"",
    'text': '''لصلاة على النبي
وَقَالَ صلى الله عليه وسلم: ((الْبَخِيلُ مَنْ ذُكِرْتُ عِنْدَهُ فَلَمْ يُصَلِّ عَلَيَّ)).
'''
  },
  {
    'id': '4',
    "details":"",
    'text': '''الصلاة على النبي
وَقَالَ صلى الله عليه وسلم:((إِنَّ لِلَّهِ مَلاَئِكَةً سَيَّاحِينَ فِي الْأَرْضِ يُبَلِّغُونِي مِنْ أُمَّتِي السَّلاَمَ)).'''
  },
  {
    'id': '5',
    'text': '''الصلاة على النبي
وَقَالَ صلى الله عليه وسلم: ((مَا مِنْ أَحَدٍ يُسَلِّمُ عَلَيَّ إِلاَّ رَدَّ اللَّهُ عَلَيَّ رُوحِيَ حَتَّى أَرُدَّ عَلَيْهِ السَّلاَمَ)).'''
  },
];






//اذكار الاستيقاظ

List  wakeup = [
  {
    "id": "1",
    "details":"",
    "text": ''' أذكار الأستيقاظ
( الْحَمْدُ للَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا، وَإِلَيْهِ النُّشُورُ )
'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''أذكار الأستيقاظ
( لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَريكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، سُبْحَانَ اللَّهِ، وَالْحَمْدُ للَّهِ، وَلاَ إِلَهَ إِلاَّ اللَّهُ، وَاللَّهُ أَكبَرُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ الْعَلِيِّ الْعَظِيمِ، رَبِّ اغْفرْ لِي ).'''
},
  {
    'id': '3',
    "details":"",
    'text': '''أذكار الأستيقاظ
( الْحَمْدُ لِلَّهِ الَّذِي عَافَانِي فِي جَسَدِي، وَرَدَّ عَلَيَّ رُوحِي، وَأَذِنَ لي بِذِكْرِهِ )
'''
  },
  {
    'id': '4',
    "details":"",
    'text': '''أذكار الأستيقاظ
﴿ إِنَّ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ وَاخْتِلاَفِ اللَّيْلِ وَالنَّهَارِ لَآيَاتٍ لأُوْلِي الألْبَابِ ۝ الَّذِينَ يَذْكُرُونَ اللَّهَ قِيَاماً وَقُعُوداً وَعَلَىَ جُنُوبِهِمْ وَيَتَفَكَّرُونَ فِي خَلْقِ السَّمَوَاتِ وَالأَرْضِ رَبَّنَا مَا خَلَقْتَ هَذا بَاطِلاً سُبْحَانَكَ فَقِنَا عَذَابَ النَّارِ ۝ رَبَّنَا إِنَّكَ مَن تُدْخِلِ النَّارَ فَقَدْ أَخْزَيْتَهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ ۝ رَّبَّنَا إِنَّنَا سَمِعْنَا مُنَادِياً يُنَادِي لِلإِيمَانِ أَنْ آمِنُواْ بِرَبِّكُمْ فَآمَنَّا رَبَّنَا فَاغْفِرْ لَنَا ذُنُوبَنَا وَكَفِّرْ عَنَّا سَيِّئَاتِنَا وَتَوَفَّنَا مَعَ الأبْرَارِ ۝ رَبَّنَا وَآتِنَا مَا وَعَدتَّنَا عَلَى رُسُلِكَ وَلاَ تُخْزِنَا يَوْمَ الْقِيَامَةِ إِنَّكَ لاَ تُخْلِفُ الْمِيعَادَ ۝ فَاسْتَجَابَ لَهُمْ رَبُّهُمْ أَنِّي لاَ أُضِيعُ عَمَلَ عَامِلٍ مِّنكُم مِّن ذَكَرٍ أَوْ أُنثَى بَعْضُكُم مِّن بَعْضٍ فَالَّذِينَ هَاجَرُواْ وَأُخْرِجُواْ مِن دِيَارِهِمْ وَأُوذُواْ فِي سَبِيلِي وَقَاتَلُواْ وَقُتِلُواْ لأُكَفِّرَنَّ عَنْهُمْ سَيِّئَاتِهِمْ وَلأُدْخِلَنَّهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ ثَوَاباً مِّن عِندِ اللَّهِ وَاللَّهُ عِندَهُ حُسْنُ الثَّوَابِ ۝ لاَ يَغُرَّنَّكَ تَقَلُّبُ الَّذِينَ كَفَرُواْ فِي الْبِلاَدِ ۝ مَتَاعٌ قَلِيلٌ ثُمَّ مَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمِهَادُ ۝ لَكِنِ الَّذِينَ اتَّقَوْاْ رَبَّهُمْ لَهُمْ جَنَّاتٌ تَجْرِي مِنْ تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا نُزُلاً مِّنْ عِندِ اللَّهِ وَمَا عِندَ اللَّهِ خَيْرٌ لِّلأَبْرَارِ ۝ وَإِنَّ مِنْ أَهْلِ الْكِتَابِ لَمَن يُؤْمِنُ بِاللَّهِ وَمَا أُنزِلَ إِلَيْكُمْ وَمَآ أُنزِلَ إِلَيْهِمْ خَاشِعِينَ لِلَّهِ لاَ يَشْتَرُونَ بِآيَاتِ اللَّهِ ثَمَناً قَلِيلاً أُوْلَئِكَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ إِنَّ اللَّهَ سَرِيعُ الْحِسَابِ ۝ يَا أَيُّهَا الَّذِينَ آمَنُواْ اصْبِرُواْ وَصَابِرُواْ وَرَابِطُواْ وَاتَّقُواْ اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ﴾'''
},
  
];










//ايه وعبره
 List aya = [
  {
    "id": "1",
    "text": ''' 
۞ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ ۞

''',
    'details': '''َ
    إنَّ ضَاقْت في عَينَيك الدُنيا فـ لكَ في الإسِتغفَارِ فَرَجاً كَبيراً'
    ''',
      },
  {
    'id': '2',
    'text': '''
۞ وَبَشِّرِ الصَّابِرِين ۞
''',
 'details': '''
  تشتَد وتشْتد وتَشتد ، ثُمَّ يأتِي الفرَج من حِيث لا تحتسب .فكُن علَى ثقَه بِالله دائمًا ، ستأتِي بَعدَ زحام البلاء أفراح ! 
  ''',
   },
  {
    'id': '3',
    'text': '''
۞ وَالْكَاظِمِينَ الْغَيْظَ ۞
''',
    'details': '''لن ينسى الله سكوتك عن الكلام ، ولا عتباً كتمته ، ولا قهرًا لجمته ، ولا ألماً تحملته ، فـثق بالله وأطمئن 
    ''',
      },
  {
    'id': '4',
    'text': '''
۞ وَالْكَاظِمِينَ الْغَيْظَ ۞
''',
   'details': ''' لن ينسى الله سكوتك عن الكلام ، ولا عتباً كتمته ، ولا قهرًا لجمته ، ولا ألماً تحملته ، فـثق بالله وأطمئن 
   ''',
    },
  {
    'id': '5',
    'text': '''
۞ فَدَعَا رَبَّهُ أَنِّي مَغْلُوبٌ فَانتَصِرْ ۞
''',
    'details': ''' إهتف بوجعك ، بمرضك بانكسارك بهزيمتك بعجزك ، حينها يأتيك الفرج من رب السّماء .. ياا رب 
    ''',
      },
];








//الادعيه
List aladayh = [
  {
    "1d": "1",
    "details":"",
    "text": ''' 
من دعاء دخول السوق

(لا إله إلا الله وحده لا شريك له، له الملك، وله الحمد، يحيي ويميت، وهو حي لا يموت، بيده الخير، وهو على كل شيء قدير)

'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''من ما يقول من أتاه أمر يسره أو يكرهه

(كان النبي صلى الله عليه وسلم إذا أتاه الأمر يسره قال: (الحمد لله الذي بنعمته تتم الصالحات) وإذا أتاه الأمر يكرهه قال: (الحمد لله على كل حال)'
'''
  },
  {
    'id': '3',
    'text': '''من دعاء الغضب

(أعوذ بالله من الشيطان الرجيم)
''',
  },
  {
    'id': '4',
    "details":"",
    'text': '''
من الدعاء قبل الطعام

(إذا أكل أحدكم طعاما فليقل بسم الله، فإن نسي في أوله فليقل بسم الله في أوله وآخره)
'''
 },
  {
    'id': '5',
    "details":"",
    'text': '''من الدعاء عند إغماض الميت

(اللهم اغفر لفلان (باسمه) وارفع درجته في المهديين، واخلفه في عقبه في الغابرين، واغفر لنا وله يا رب العالمين، وافسح له في قبره، ونور له فيه)
'''
  },
  {
    'id': '6',
    "details":"",
    'text': '''من الدعاء للميت في الصلاة عليه

(اللهم اغفر له وارحمه، وعافه، واعف عنه، وأكرم نزله، ووسع مدخله، واغسله بالماء والثلج والبرد، ونقه من الخطايا كما نقيت الثوب الأبيض من الدنس، وأبدله دارا خيرا من داره، وأهلا خيرا من أهله، وزوجا خيرا من زوجه، وأدخله الجنة، وأعذه من عذاب القبر [وعذاب النار])
''' },
  {
    'id': '7',
    "details":"",
    'text': '''
من دعاء التعزية

(إن لله ما أخذ، وله ما أعطى، وكل شيء عنده بأجل مسمى... فلتصبر ولتحتسب) وإن قال: (أعظم الله أجرك، وأحسن عزاءك، وغفر لميتك) 
'''
  },
  {
    'id': '8',

    "details":"",
    'text': '''
من الدعاء عند إدخال الميت القبر

(بسم الله وعلى سنة رسول الله)
'''
  },
  {
    'id': '9',
    "details":"",
    'text': '''من الدعاء بعد دفن الميت

(اللهم اغفر له، اللهم ثبته)
'''
 },
  {
    'id': '10',
    "details":"",
    'text': '''من دعاء زيارة القبور

(السلام عليكم أهل الديار، من المؤمنين والمسلمين، وإنا إن شاء الله بكم لاحقون، [ويرحم الله المستقدمين منا والمستأخرين] أسال الله لنا ولكم العافية)
'''
  },
];







//تسبيح مابعد الصلاه
List tsabuh = [
  {
    "id": "1",
    "details":"",
    "text": ''' 
تسابيح مابعد الصلاة
أستغفر الله، أستغفر الله، أستغفر الله 
اللهُمّ أنت السلام، ومنك السلام، تباركت يا ذا الجلال والإكرام 
عن ثوبان مولى رسول الله صلى الله عليه وسلم:  
«كان رسولُ اللهِ -صلَّى اللهُ عليه وسلَّمَ- إذا انصرف من صلاتِه، استغفر ثلاثًا، وقال: اللهمَّ أنت السلامُ ومنك السلامُ، تباركت يا ذا الجلالِ والإكرامِ». 

'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''تسابيح مابعد الصلاة
اللهمَّ أعنِّي على ذكرك وشكرك وحسن عبادتك 
عن معاذ بن جبل رضي الله عنه قال: 
«أخذَ رسولَ اللَّهِ -صلَّى اللَّهُ عليهِ وسلَّمَ- بيدي يومًا، فقالَ: يا معاذُ إنِّي واللَّهِ لأحبُّك. فقالَ معاذٌ: بأبي أنتَ وأمِّي يا رسولَ اللَّهِ، وأنا واللَّهِ أحبُّكَ، فقالَ: أوصيكَ يا معاذُ لا تدَعَنَّ دُبرَ كلِّ صلاةٍ مكتوبةٍ أن تقولَ: اللَّهمَّ أعنِّي على ذِكرِكَ، وشُكرِكَ، وحُسنِ عبادتِكَ». 
'''
  },
  {
    'id': '3',
    "details":"",
    'text': '''تسابيح مابعد الصلاة
سبحان الله
عن الرسول صلّى الله عليه وسلم أنّه قال:  
«أفلا أُعلِّمكم شيئًا تُدركون به مَن سبقَكم وتَسبقون به من بعدكم، ولا يكون أحدٌ أفضل منكم إلا من صنع مثلَ ما صنعتُم؟ قالوا: بَلى يا رَسولَ الله، قال: تُسبِّحونَ وَتُكَبِّرُونَ وَتُحَمِّدونَ دُبُرَ كلِّ صلاةٍ ثلاثًا وثلاثين مرّةً». 
''',
  },
  {
    'id': '4',
    "details":"",
    'text': '''
سابيح مابعد الصلاة
لا إلهَ إلَّا اللَّهُ وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحمدُ، وهوَ على كلِّ شيءٍ قدير 
عن الرسول صلّى الله عليه وسلم أنّه قال:  
(من سبَّحَ اللَّهَ في دُبُرِ كلِّ صلاةٍ ثلاثاً وثلاثينَ، وحمدَ اللَّهَ ثلاثاً وثلاثينَ، وكبَّرَ اللَّهَ ثلاثاً وثلاثينَ، فتلكَ تسعةٌ وتسعونَ، وقالَ تمامَ المئةِ لا إلهَ إلَّا اللَّهُ وحدَهُ لا شريكَ لهُ، لهُ الملكُ ولهُ الحمدُ، وهوَ على كلِّ شيءٍ قديرٌ، غُفِرت خطاياهُ، وإن كانت مثلَ زَبَدِ البحرِ) 
المصدر: تطبيق الطريق الى الجنة'''
 },
  {
    'id': '5',
    "details":"",
    'text': '''تسابيح مابعد الصلاة
اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ
عن الرسول صلّى الله عليه وسلم أنّه قال:  
«مَنْ قرأَ آيةً الكُرسِيِّ دُبُرَ كلِّ صلاةٍ مكتوبةٍ ، لمْ يمنعْهُ من دُخُولِ الجنةَ إلَّا أنْ يمُوتَ».
'''
  },
];









//حصن مسلم
List meslm = [
  {
    "id": "1",
    "details":"",
    "text": ''' 
من دعاء دخول المسجد

(يبدأ برجله اليمنى)، ويقول: (أعوذ بالله العظيم، وبوجهه الكريم، وسلطانه القديم، من الشيطان الرجيم) [بسم الله، والصلاة] [والسلام على رسول الله] (اللهم افتح لي أبواب رحمتك)

'''
  },
  {
    'id': '2',
    "details":"",
    'text': '''من دعاء الخروج من المسجد

-(يبدأ برجله اليسرى) ويقول: (بسم الله والصلاة والسلام على رسول الله، اللهم إني أسألك من فضلك، اللهم اعصمني من الشيطان الرجيم)
'''
  },
  {
    'id': '3',
    "details":"",
    'text': '''من التشهد

(التحيات لله، والصلوات، والطيبات، السلام عليك أيها النبي ورحمة الله وبركاته، السلام علينا وعلى عباد الله الصالحين. أشهد أن لا إله إلا الله وأشهد أن محمدا عبده ورسوله)
''',
  },
  {
    'id': '4',
    "details":"",
    'text': '''
من دعاء الهم والحزن

(اللهم إني عبدك، ابن عبدك، ابن أمتك، ناصيتي بيدك، ماض في حكمك، عدل في قضاؤك، أسألك بكل اسم هو لك، سميت به نفسك، أو أنزلته في كتابك، أو علمته أحدا من خلقك، أو استأثرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذهاب همي)
'''
 },
  {
    'id': '5',
    "details":"",
    'text': '''من دعاء الكرب

(لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السموات ورب الأرض ورب العرش الكريم)
'''
  },
  {
    'id': '6',
    "details":"",
    'text': '''من دعاء قضاء الدين

(اللهم اكفني بحلالك عن حرامك، وأغنني بفضلك عمن سواك)
'''
 },
  {
    'id': '7',
    "details":"",
    'text': '''
من دعاء من أصيب بمصيبة

(إنا لله وإنا إليه راجعون، اللهم أجرني في مصيبتي، وأخلف لي خيرا منها)
'''
  },
  {
    'id': '8',
    "details":"",
    'text': '''
من الدعاء عند إفطار الصائم

(ذهب الظمأ وابتلت العروق، وثبت الأجر إن شاء الله)
'''
  },
  {
    'id': '9',
    "details":"",
    'text': '''من الدعاء للمتزوج

(بارك الله لك، وبارك عليك، وجمع بينكما في خير)
'''
 },
  {
    'id': '10',
    "details":"",
    'text': '''من دعاء الركوب

(بسم الله، والحمد لله ﴿سبحان الذي سخر لنا هذا وما كنا له مقرنين، وإنا إلى ربنا لمنقلبون﴾، (الحمد لله، الحمد لله، الحمد لله، الله أكبر، الله أكبر، الله أكبر، سبحانك اللهم  إني ظلمت نفسي فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت)
'''
  },
];